app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 363246660]]
---
  def show
    if (params[:id]) == 'contact'
      redirect_to '/contact'
    elsif (params[:id]) == 'about'
     redirect_to '/about'
    elsif (params[:id]) == 'signup'
     redirect_to '/signup'
     elsif (params[:id]) == 'logout'
      redirect_to '/'
    else
      flash.now[:success] = "Welcome to my Sample App!"
      @user = User.find(params[:id])

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new(user_params)
       if @user.save